Revit 2027 API
RibbonItem.Equals Method
 Determines whether the specified Object is equal to the current Object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
public:
virtual bool Equals(
	Object^ obj
) override
abstract Equals :
        obj : Object -> bool
override Equals :
        obj : Object -> bool
Parameters
obj Object
 Another panel object.
Return Value
Boolean
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace